---
kind: enumMember
id: F:Autodesk.Revit.DB.Macros.ApplicationMacroOptions.DisableMacros
enum: Autodesk.Revit.DB.Macros.ApplicationMacroOptions
source: html/f2e09bb1-8f51-089d-dc36-c76c9a1fb683.htm
---
# Autodesk.Revit.DB.Macros.ApplicationMacroOptions.DisableMacros

The option to disable macros for the application.